In [17]:
import pandas as pd
df= pd.read_csv('C:/Users/javedyasin14700/Downloads/ds_salaries.csv')


df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

In [18]:
#First we need to extract data from Data Analyst role from job_title colum
count_column = df.shape[1]
print(count_column)

12

In [19]:
#we need to count rows from job_title 
count_row = df.shape[0]
print(count_row)

607

In [39]:
#we need to 
data_analyst = df[df["job_title"] =='Data Analyst']
data_analyst.head()

   salary     job_title region company_size
1   85000  Data Analyst   East       Medium

In [25]:
data_analyst_salary = data_analyst[['salary','company_size','job_title']]
highest_salary = data_analyst_salary.max()
lowest_salary = data_analyst_salary.min()
print("Highest salary and company size:",highest_salary)
print("Lowest salary and company size:",lowest_salary)
type(highest_salary)

Highest salary and company size: salary                450000
company_size               S
job_title       Data Analyst
dtype: object
Lowest salary and company size: salary                  8000
company_size               L
job_title       Data Analyst
dtype: object

pandas.core.series.Series

In [30]:
import pandas as pd
data = pd.DataFrame([highest_salary, lowest_salary])
print(data)

   salary company_size     job_title
0  450000            S  Data Analyst
1    8000            L  Data Analyst

In [33]:
import pandas as pd
data = pd.DataFrame([highest_salary])
print(data)

   salary company_size     job_title
0  450000            S  Data Analyst

In [35]:
data = pd.DataFrame([lowest_salary])
print(data)

   salary company_size     job_title
0    8000            L  Data Analyst

In [ ]:
salary in_usd and company_size

In [37]:
data = 'salary_in_usd': []

SyntaxError: invalid syntax (<ipython-input-37-33f7a24ba498>, line 1)

In [ ]:
data_analyst = df[df["job_title"] =='Data Analyst']
data_analyst.head()

In [40]:
df.describe()

             salary
count      5.000000
mean   74000.000000
std    14317.821063
min    55000.000000
25%    65000.000000
50%    75000.000000
75%    85000.000000
max    90000.000000